redis_test_for_auto_numa_problem/redis_test_result_L_ON_120G/memtier_benchmark_L_ON_120G_Sequential110_P2_20230625120252.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       164914.17          ---          ---        17.64218        17.79100        23.03900        25.08700    346094.29 
Gets        16491.37     16491.37         0.00        17.54874        17.79100        22.52700        24.95900     34528.80 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     181405.54     16491.37         0.00        17.63368        17.79100        22.91100        25.08700    380623.09 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.759        0.000
SET      13.183        5.000
SET      14.783       10.000
SET      16.639       15.000
SET      16.895       20.000
SET      17.151       25.000
SET      17.279       30.000
SET      17.407       35.000
SET      17.535       40.000
SET      17.663       45.000
SET      17.791       50.000
SET      17.919       52.500
SET      17.919       55.000
SET      18.047       57.500
SET      18.047       60.000
SET      18.175       62.500
SET      18.175       65.000
SET      18.303       67.500
SET      18.303       70.000
SET      18.431       72.500
SET      18.559       75.000
SET      18.559       76.250
SET      18.559       77.500
SET      18.687       78.750
SET      18.687       80.000
SET      18.815       81.250
SET      18.815       82.500
SET      18.943       83.750
SET      18.943       85.000
SET      19.071       86.250
SET      19.199       87.500
SET      19.199       88.125
SET      19.327       88.750
SET      19.327       89.375
SET      19.455       90.000
SET      19.455       90.625
SET      19.583       91.250
SET      19.583       91.875
SET      19.711       92.500
SET      19.711       93.125
SET      19.839       93.750
SET      19.967       94.062
SET      19.967       94.375
SET      20.095       94.688
SET      20.095       95.000
SET      20.223       95.312
SET      20.351       95.625
SET      20.479       95.938
SET      20.607       96.250
SET      20.863       96.562
SET      21.119       96.875
SET      21.375       97.031
SET      21.503       97.188
SET      21.759       97.344
SET      21.887       97.500
SET      22.015       97.656
SET      22.143       97.812
SET      22.271       97.969
SET      22.399       98.125
SET      22.399       98.281
SET      22.527       98.438
SET      22.655       98.516
SET      22.655       98.594
SET      22.655       98.672
SET      22.783       98.750
SET      22.783       98.828
SET      22.911       98.906
SET      22.911       98.984
SET      23.039       99.062
SET      23.167       99.141
SET      23.295       99.219
SET      23.295       99.258
SET      23.423       99.297
SET      23.423       99.336
SET      23.551       99.375
SET      23.551       99.414
SET      23.679       99.453
SET      23.807       99.492
SET      23.807       99.531
SET      23.935       99.570
SET      24.063       99.609
SET      24.063       99.629
SET      24.191       99.648
SET      24.191       99.668
SET      24.191       99.688
SET      24.319       99.707
SET      24.319       99.727
SET      24.447       99.746
SET      24.447       99.766
SET      24.575       99.785
SET      24.575       99.805
SET      24.703       99.814
SET      24.703       99.824
SET      24.703       99.834
SET      24.831       99.844
SET      24.831       99.854
SET      24.959       99.863
SET      24.959       99.873
SET      24.959       99.883
SET      25.087       99.893
SET      25.215       99.902
SET      25.215       99.907
SET      25.215       99.912
SET      25.343       99.917
SET      25.343       99.922
SET      25.471       99.927
SET      25.471       99.932
SET      25.599       99.937
SET      25.599       99.941
SET      25.727       99.946
SET      25.855       99.951
SET      25.855       99.954
SET      25.983       99.956
SET      25.983       99.958
SET      26.111       99.961
SET      26.111       99.963
SET      26.239       99.966
SET      26.495       99.968
SET      26.623       99.971
SET      26.879       99.973
SET      27.391       99.976
SET      27.903       99.977
SET      28.415       99.978
SET      28.799       99.979
SET     225.279       99.980
SET     235.519       99.982
SET     241.663       99.983
SET     246.783       99.984
SET     247.807       99.985
SET     249.855       99.987
SET     252.927       99.988
SET     252.927       99.988
SET     254.975       99.989
SET     254.975       99.990
SET     254.975       99.990
SET     257.023       99.991
SET     257.023       99.991
SET     257.023       99.992
SET     258.047       99.993
SET     260.095       99.993
SET     262.143       99.994
SET     264.191       99.994
SET     264.191       99.995
SET     264.191       99.995
SET     264.191       99.995
[...]
SET     264.191       99.996
SET     264.191       99.996
SET     264.191       99.996
SET     266.239       99.997
SET     266.239       99.997
SET     266.239       99.997
[...]
SET     268.287       99.997
SET     268.287       99.998
SET     268.287       99.998
SET     270.335       99.998
SET     270.335       99.998
SET     270.335       99.998
[...]
SET     270.335       99.999
SET     270.335       99.999
SET     270.335       99.999
[...]
SET     272.383       99.999
SET     272.383       99.999
SET     272.383       99.999
[...]
SET     272.383      100.000
SET     272.383      100.000
SET     272.383      100.000
[...]
SET     274.431      100.000
SET     274.431      100.000
SET     274.431      100.000
[...]
SET     276.479      100.000
SET     276.479      100.000
SET     276.479      100.000
[...]
SET     278.527      100.000
SET     278.527      100.000
---
GET       1.575        0.000
GET      13.183        5.000
GET      14.207       10.000
GET      16.511       15.000
GET      16.895       20.000
GET      17.151       25.000
GET      17.279       30.000
GET      17.407       35.000
GET      17.535       40.000
GET      17.663       45.000
GET      17.791       50.000
GET      17.791       52.500
GET      17.919       55.000
GET      17.919       57.500
GET      18.047       60.000
GET      18.047       62.500
GET      18.175       65.000
GET      18.175       67.500
GET      18.303       70.000
GET      18.431       72.500
GET      18.431       75.000
GET      18.559       76.250
GET      18.559       77.500
GET      18.559       78.750
GET      18.687       80.000
GET      18.687       81.250
GET      18.815       82.500
GET      18.815       83.750
GET      18.943       85.000
GET      19.071       86.250
GET      19.071       87.500
GET      19.199       88.125
GET      19.199       88.750
GET      19.199       89.375
GET      19.327       90.000
GET      19.327       90.625
GET      19.455       91.250
GET      19.455       91.875
GET      19.583       92.500
GET      19.583       93.125
GET      19.711       93.750
GET      19.711       94.062
GET      19.711       94.375
GET      19.839       94.688
GET      19.839       95.000
GET      19.967       95.312
GET      19.967       95.625
GET      20.095       95.938
GET      20.095       96.250
GET      20.223       96.562
GET      20.351       96.875
GET      20.351       97.031
GET      20.479       97.188
GET      20.607       97.344
GET      20.607       97.500
GET      20.735       97.656
GET      20.991       97.812
GET      21.119       97.969
GET      21.375       98.125
GET      21.631       98.281
GET      22.015       98.438
GET      22.015       98.516
GET      22.143       98.594
GET      22.271       98.672
GET      22.271       98.750
GET      22.399       98.828
GET      22.527       98.906
GET      22.527       98.984
GET      22.655       99.062
GET      22.783       99.141
GET      22.783       99.219
GET      22.911       99.258
GET      22.911       99.297
GET      23.039       99.336
GET      23.039       99.375
GET      23.167       99.414
GET      23.167       99.453
GET      23.295       99.492
GET      23.423       99.531
GET      23.551       99.570
GET      23.679       99.609
GET      23.679       99.629
GET      23.807       99.648
GET      23.807       99.668
GET      23.935       99.688
GET      23.935       99.707
GET      24.063       99.727
GET      24.063       99.746
GET      24.191       99.766
GET      24.319       99.785
GET      24.319       99.805
GET      24.447       99.814
GET      24.447       99.824
GET      24.447       99.834
GET      24.575       99.844
GET      24.575       99.854
GET      24.703       99.863
GET      24.703       99.873
GET      24.831       99.883
GET      24.831       99.893
GET      24.959       99.902
GET      24.959       99.907
GET      24.959       99.912
GET      25.087       99.917
GET      25.087       99.922
GET      25.215       99.927
GET      25.215       99.932
GET      25.343       99.937
GET      25.343       99.941
GET      25.471       99.946
GET      25.599       99.951
GET      25.727       99.954
GET      25.727       99.956
GET      25.855       99.958
GET      25.983       99.961
GET      25.983       99.963
GET      26.111       99.966
GET      26.239       99.968
GET      26.495       99.971
GET      26.879       99.973
GET      27.391       99.976
GET      28.031       99.977
GET      28.543       99.978
GET      28.671       99.979
GET     229.375       99.980
GET     237.567       99.982
GET     242.687       99.983
GET     246.783       99.984
GET     248.831       99.985
GET     249.855       99.987
GET     252.927       99.988
GET     252.927       99.988
GET     254.975       99.989
GET     254.975       99.990
GET     254.975       99.990
GET     255.999       99.991
GET     257.023       99.991
GET     257.023       99.992
GET     258.047       99.993
GET     259.071       99.993
GET     261.119       99.994
GET     262.143       99.994
GET     264.191       99.995
GET     264.191       99.995
GET     264.191       99.995
[...]
GET     264.191       99.996
GET     264.191       99.996
GET     264.191       99.996
GET     266.239       99.997
GET     266.239       99.997
GET     266.239       99.997
[...]
GET     268.287       99.998
GET     268.287       99.998
GET     268.287       99.998
[...]
GET     270.335       99.998
GET     270.335       99.998
GET     270.335       99.998
GET     270.335       99.999
GET     270.335       99.999
GET     270.335       99.999
[...]
GET     272.383       99.999
GET     272.383       99.999
GET     272.383       99.999
GET     272.383      100.000
GET     272.383      100.000
GET     272.383      100.000
[...]
GET     274.431      100.000
GET     274.431      100.000
GET     274.431      100.000
[...]
GET     278.527      100.000
GET     278.527      100.000
---
WAIT      0.000      100.000